---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.PlenumWithNoCeilingWarn
source: html/c5624f74-c0c8-e701-641d-a23636a403a7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.PlenumWithNoCeilingWarn Property

[Room] has Space Type set to Plenum but has no ceiling surface. A plenum must be separated from the space it serves by a ceiling.

## Syntax (C#)
```csharp
public static FailureDefinitionId PlenumWithNoCeilingWarn { get; }
```